app/controllers/filterlists_controller.rb

  def index
    @filterlists = Filterlist.all
---
SELECT * FROM "filterlists"

  def show
    @filterlist = Filterlist.find(params[:id])
---
SELECT * FROM "filterlists" WHERE ("filterlists"."id" = 1)

  def edit
    @filterlist = Filterlist.find(params[:id])
---
SELECT * FROM "filterlists" WHERE ("filterlists"."id" = 1)

  def create
    @filterlist = Filterlist.new(params[:filterlist])

    respond_to do |format|
      if @filterlist.save
---
INSERT INTO "filterlists" ("name", "regexp", "ep", "created_at", "updated_at") VALUES('House', 'house[^w].*6[^0-9]*x', 15, '2010-03-05 13:23:26', '2010-03-05 13:23:26')

  def update
    @filterlist = Filterlist.find(params[:id])

    respond_to do |format|
      if @filterlist.update_attributes(params[:filterlist])
---
SELECT * FROM "filterlists" WHERE ("filterlists"."id" = 1)
UPDATE "filterlists" SET "updated_at" = '2010-03-05 15:40:51', "ep" = 9, "regexp" = 'sora.*no.*woto', "name" = 'sora no woto' WHERE "id" = 1