app/controllers/home_controller.rb

SELECT * FROM "rsslists"
SELECT * FROM "filterlists"
---
  def scan
    @prefs=pref.symbolize_keys[:pref]
    @rss = Rsslist.all
    @nbrss = @rss.length
    @filter = Filterlist.all

UPDATE "filterlists" SET "updated_at" = '2010-03-05 16:36:21', "ep" = 10 WHERE "id" = 1
---
      }
    }
    threads.each { |aThread|  aThread.join }
    increm.uniq.each{|a| Filterlist.find(a[0]).update_attribute('ep', a[1]+1) }

SELECT * FROM "rsslists"
---
  def index
    @prefs=pref.symbolize_keys[:pref]
    @truc = Rsslist.all