app/controllers/rsslists_controller.rb

SELECT * FROM "rsslists"
---
  def index
    @rsslists = Rsslist.all

SELECT * FROM "rsslists" WHERE ("rsslists"."id" = 1)
---
  def show
    @rsslist = Rsslist.find(params[:id])

SELECT * FROM "rsslists" WHERE ("rsslists"."id" = 1)
---
  def edit
    @rsslist = Rsslist.find(params[:id])

INSERT INTO "rsslists" ("name", "created_at", "updated_at", "adress") VALUES('EzTV', '2010-03-05 13:15:21', '2010-03-05 13:15:21', 'une adresse')
---
  def create
    @rsslist = Rsslist.new(params[:rsslist])
    @prefs=pref.symbolize_keys[:pref]
    respond_to do |format|
      if @rsslist.save

SELECT * FROM "rsslists" WHERE ("rsslists"."id" = 1)
UPDATE "rsslists" SET "updated_at" = '2010-03-05 15:40:13', "adress" = 'http://animesuki.allanime.org/rss.php', "name" = 'animesuki' WHERE "id" = 1
---
  def update
    @rsslist = Rsslist.find(params[:id])
    @prefs=pref.symbolize_keys[:pref]
    respond_to do |format|
      if @rsslist.update_attributes(params[:rsslist])

SELECT * FROM "rsslists" WHERE ("rsslists"."id" = 2)
DELETE FROM "rsslists" WHERE "id" = 2
---
  def destroy
    @rsslist = Rsslist.find(params[:id])
    @rsslist.destroy